chap04/dispatch/GetOrdersDatesSOAPRequest_doclitbare.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--! <example xn="DOC_LIT_SOAP_REQUEST"> -->
<!--! <c>chap04</c><s>dispatch</s> -->
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Body xmlns:getord="http://www.example.com/oms/getorders">
    <getord:startDate>2005-11-19</getord:startDate>
    <getord:endDate>2005-11-22</getord:endDate>
  </env:Body>
</env:Envelope>
<!--! </example> -->
